---
title: Workset
classe: Autodesk.Revit.DB.Workset
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.WorksetPreview
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# Workset

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEditable { get; }` | `workset.IsEditable` | Boolean |
| `Boolean IsOpen { get; }` | `workset.IsOpen` | Boolean |
| `Boolean IsVisibleByDefault { get; }` | `workset.IsVisibleByDefault` | Boolean |
| `WorksetKind Kind { get; }` | `workset.Kind` | WorksetKind |
| `Workset Create(Document, String)` | `Workset.Create(document, name)` | Workset |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```